image splash = "Techvorious.png"

label splashscreen:
    scene black
    with Pause(1)

    play sound "Techvorious Open.mp3"

    show splash with dissolve
    with Pause(2)

    scene black with dissolve
    with Pause(1)

    return

define s = Character('千鹤', color="#ff69b4")
define m = Character('宮', color="#A2A2FF")
define g = Character('圭', color="#69FFBD")

label start:

    stop music
    scene black with dissolve

    "序章"

    play music "無くならない大事な心.ogg"
    scene bg space
    with fade 
    "繁星陨落"

    "在广袤无垠的宇宙中，星辰是生命的象征，承载着无限的智慧与力量。星辰的光芒指引着人们前行，给予他们希望与勇气。"

    "……"

    "夜晚，小溪边的草地上洒满了银色的月光。微风轻拂，草丛中点点的白色花朵，绽放出迷人的清香。萤火虫如繁星般在空中飞舞，闪烁着柔和的金光，为夜晚增添了一份神秘和浪漫。"

    "父亲和儿子静静地躺在草地上，眺望着无垠的星空。蝉鸣声在林间响起，溪水轻声流淌，平静和安宁，宛如大自然演奏的圆舞曲。"

    "父亲""儿子，今晚的星空真美丽啊。你知道吗，星辰被认为拥有着特殊的力量。"

    "男孩""力量？爸爸，星辰为什么会有特殊的力量？它们能给予我们什么？"

    "父亲""嗯，儿子，星辰在人们心中象征着信仰和指引。它们似乎能够赋予我们一种不为人知的力量，让我们能够超越平凡，实现梦想，探索宇宙的奥秘。"

    "男孩""那这些力量具体是什么样的呢？它们可以让我们做些什么呢？"

    "父亲""这些力量是多种多样的，因人而异。有的人可能通过星辰获得了超凡的智慧，能够理解宇宙的规律；有的人可能获得了强大的意念，可以改变物质的状态；还有的人可能获得了治愈的能力，帮助他人摆脱痛苦。"

    "父亲""想要获得星辰的力量，就必须要得到它们的认可，但人们到现在还没搞清楚这个来自宇宙的神秘物质到底是由什么构成，更别说如何获得星辰的力量。"

    "父亲""貌似每个星辰都有不同的\"性格\"，因此被认可的方式也有所不同。当然，能获得星辰力量的人类只是微乎其微。"

    "男孩""爸爸，我很想亲眼见到一颗坠落的星辰，获得它们所赋予的力量。"

    "父亲""儿子，你的求知欲真是让我钦佩。但我们要知道，星辰的力量是神秘而不可预测的，它们会选择那些真正渴望和有准备去迎接它们的人。"

    "父亲""况且，力量有时会使人迷失自我，甚至带来灾难。"

    "男孩""我明白。我会努力去追寻宇宙的奥秘，无论是否能够获得星辰的力量，我都希望能够为这个美好的世界献上祝福。"

    "父亲""儿子，你长大了，我真的感觉非常自豪。无论你将来成为什么样的人，只要你心怀善意，我相信你一定会走出属于自己的辉煌道路。"

    "一颗流星划过夜空"

    "父亲""儿子，看！有一颗流星！这是个难得的机会，快许下你的愿望吧！"

    "男孩闭上眼睛，默念心中的愿望。"

    "父亲""我相信你会成为一个博学而有爱心的人。现在，让我们一起享受这美妙的夜晚吧，用心感受宇宙的奇迹。"

    "男孩""嗯嗯！"

    "……"

    scene bg home
    with fade

    "在一个宁静的夜晚，青年独自坐在房间里，握着游戏手柄，专注地与虚拟世界交织。"

    "青年""哇，这个角色真是太棒了！而且她超可爱！我一定要把她抽到！！"

    "青年""出了！20抽3只！不错不错！！"

    "看着屏幕中灵动的美少女，青年的心仿佛被融化了。"

    "青年""主线剧情还没做呢，好期待！！又可以幻想着去约会了…"

    "青年开始专注的过着主线剧情。"

    "他沉浸在游戏的世界中，与角色一同经历冒险与挑战。突起，一声惨叫把青年从幻想中惊醒，角色被黑色的虚影命中，身体逐渐变淡，倒下在男主面前。"

    "\"我…还不想死…\""

    "随后消失在主角的怀里。"

    "……"

    "青年""哈？？？！！！"

    "青年""哇！狗策划，你在干什么？我才刚抽到欸！不是说进卡池的角色不会被刀吗？？？"

    "他感到一阵强烈的悲痛和无助，心中充满了对角色的痛惜。"

    "随之而来的是愤怒后的空虚。"

    "\"相顾无言，惟有泪千行。\""

    "青年""…"

    show mat star at center
    with dissolve

    "突然，一颗闪烁着璀璨光芒的星辰凭空出现在青年的身旁。它散发出一股神秘而古老的气息，似乎是对他内心渴望的回应。"

    "青年充满好奇地伸出手，轻轻触摸那颗星辰。在接触的瞬间，一股奇异的能量从星辰中涌出，照亮了他的房间，他也昏昏沉沉的倒在床上。"

    "当他再次睁开眼睛时，发现自己置身于一个神秘而壮美的空间。"

    scene bg sky
    with fade

    "？""人类…你…？啊，是你啊，您好。"

    "青年""？"

    "？""我是信念的使者，自从宇宙诞生起我就已经存在了。对了，这里是令尊留给您的礼物，也许这是在您绝望之时的希望。当然，选择的权力在您手中，我只负责遵守令尊签下的契约。"

    "？""您可以选择留在这里继续过着平凡的生活，或者去到另一个宇宙，与其他伙伴一起拯救死亡的角色。"

    "青年""另一个宇宙？真如父亲所说的，星辰是通往其他宇宙的钥匙？"

    "？""是的。"

    "青年""那我父亲的真实身份是什么？"

    "？""无可奉告。"

    "青年""好吧。至于你说的礼物，只有这一个选择吗？"

    "？""当然不是。这整个空间都属于您。"

    "青年环顾四周，打量着不符合现实的星空和踩在水面上的双脚。"

    "青年""这是哪里？"

    "？""令尊用『空间之杖』在宇宙空洞创造出的空间"

    scene bg skyy
    with fade

    "青年眼前一闪，到了一片新的区域，和刚才的区域没什么区别。"

    "青年""真美啊！"

    "青年对眼前的景色大为震撼。"

    "青年""什么是『空间之杖』？"

    "？""…"

    "？""我知道您还有许多的疑问，但令尊曾说过，您在没有做好准备前没有发问的权力，很抱歉暂时无法解答您的问题。"

    "青年点了点头"

    "青年""那我总不能什么都不知道就去另一个宇宙吧…"

    "？""您真是，和令尊一样难缠呢。"

    scene bg sky
    with fade

    "？""事实上，那个宇宙中的世界，和这个宇宙并无差别。为了方便，我还是简称\"这个宇宙\"为\"前宇宙\"，\"那个宇宙\"为\"后宇宙\"。"

    "？""至于后宇宙，不会有什么奇奇怪怪的小说中或者游戏中的设定，比如\"冒险者公会\"。"

    "？""后宇宙不过是另一个\"世界泡\"，更确切的说，是前宇宙的未来。"

    "？""后宇宙的人们解析了人类的基因，将前宇宙定义为上古文明，因为在他们看来，人类已经灭绝过一次，经过宇宙的轮回，人类再一次出现在另一个宇宙，也就是后宇宙。"

    "？""而现在，后宇宙正处于现在前宇宙的阶段，也就是0.7级的宇宙文明水平。因此即使相差几十亿年，您依然可以不费吹灰之力适应后宇宙的世界。"

    "？""神奇的是，后宇宙能记录并映射前宇宙的事件，即使是虚拟的，被记录在游戏或小说漫画中的世界，也会映射到后宇宙。当然，现实中的前宇宙一样会映射到后宇宙。"

    "？""这种映射并不是将其插入在后宇宙的世界中，想要访问这些世界，还是需要一些技术手段并做好防护措施。毕竟您也不希望进入一个游戏的世界碰巧发生漏洞将您抹除吧。"

    "？""高风险带来的是高回报，前宇宙映射的世界属于实体并且可以被带离，可以保留一切自身性质，通过技术手段，您可以修改这些实体的信息，如记忆，遭遇等。这也许就是您此行的目的。"

    "？""哦对了，您要注意，因为有「时间湍流」的和几十亿年的时间差存在，任何人在后宇宙的行为是不会影响前宇宙的，但由前宇宙映射的世界是会跟随前宇宙实时改变的。"

    "？""大概就是这些了，更多的问题还请您一段时间后再来问我，我很高兴下次遇到成长后的您，所以，请做出您的选择吧！"

    "青年思考再三，无论如何还是放不下喜欢的角色，于是他选择去拯救她们。"

    "？""您会被这个宇宙抹除一切痕迹，没人会记住您的存在，您也会失去在这个宇宙拥有的一切，只能携带记忆前往另一个宇宙，您确定要继续前往吗？"

    "青年""我确定！"

    "？""既然您选择前往后宇宙，就让我定义一下您新的身份吧。"

    "？""物种：人类 性别：男 身高：188cm 年龄：20岁 发色：白 瞳孔色… "

    "青年""说重点！"

    "？""您将作为一个全新的个体前往位于后宇宙的地球，您的身份是「奥斯勒」集团创始人的长子，藤原氏第7代，藤原宮。"

    "？""您的父亲，藤原博，也就是令尊在位于后宇宙地球的身份，是「奥斯勒」集团创始人，但已经销声匿迹多年。"

    "？""您会拥有可以自动识别的身份和「奥斯勒」集团的最高权力，可以控制「奥斯勒」集团的财产，人力物力等等，这是令尊送给您的第一件见面礼。"

    "？""「奥斯勒」集团在位于后宇宙的地球上几乎人尽皆知，是著名的虚拟现实技术的开发公司，几乎全球的人们都在使用「奥斯勒」集团的产品。"

    "？""「奥斯勒」集团打造的虚拟世界\"青空\"已经成为人类生活中不可缺少的一部分，人们在青空里工作，学习，娱乐，甚至青空中的货币也可以用于现实。"

    "？""当然，「奥斯勒」集团也拥有无人知晓的一面。令尊通过『空间之杖』和『时间之玥』获得了未来更先进的科技，将它们带到这个世界，未来科技的先进程度远不是那里的人们所能理解的。"

    "？""这些知识一旦泄露，世界的扭曲就会成倍增加，会导致整个文明的覆灭。但这些知识也为「奥斯勒」集团提供了大量的科技资源，比如可以接近光速的移动，大幅延长有机生物寿命等等。"

    "？""而您的目标，则是利用这些技术去到前宇宙映射的虚拟世界中拯救您的角色，这就需要用到令尊送给您的第二件见面礼——「奥斯勒」空间站，具体的内容后面会为您介绍。它的主要作用，是可以在世界与世界间折跃。"

    "？""当然，「奥斯勒」空间站也是您探索虚拟世界的武器。好了，大概的内容就是这些，即将送您到「奥斯勒」集团的总部，请您做好心理准备。"

    "一阵白光闪过…"

    stop music fadeout 1.0
    scene black with dissolve
  
    "第一幕"

    play music "Sunlight.ogg"

    scene bg heal
    with fade

    "青年从医疗仓中苏醒，他本能的爬出医疗仓，环顾四周，没有一个人在。"

    "他拿起桌子上盛有肥宅快乐水的杯子，啜饮一口。"

    "走到镜子前看着自己的容貌，倍感自豪。"

    m "嗯，看起来还不错。这个身高，的确是我过去所期望的。话说这个白毛…老爹你是白毛控吗？"

    m "蓝色瞳孔？我想想…宛如幽蓝深邃的湖泊，清澈而富有智慧。算了算了，语文学成那样子的我还真是不适合拽词。"

    "青年的目光从自己的脸上转移到身体上。"

    m "腹肌！我竟然有腹肌！！老爹我太感谢你了！"

    "目光再次下移。"

    m "这尺寸不错喔！emm…嘶嘶嘶~~~"

    "在手指触碰的一瞬间，大脑就像触电了一样，青年立刻松开了手。"

    m "这也太…太敏感了吧！话说老爹给我定义个处男也就罢了，但也不能一次都没用过吧…得找件衣服，这宝贝可不能被别人看见。"

    "青年穿上了放在医疗仓旁边的衣服，再次站在镜子前，右手端着杯子，左手轻握衣领，端详自己的绝世容颜。"

    show me a at center with dissolve

    m "嗯，我倒不是特别自恋，但是真的好帅啊！"

    hide me a with dissolve

    play sound "knock.mp3"

    "一声门铃打断了宮的自我欣赏。"

    m "请进。"

    "进来了两位身着正装的人。"

    show guy a at left with dissolve

    "？""醒了！我看看，医疗仓的波动的确是两分钟前，应该没什么问题了。你…有没有哪里不适？"

    m "貌似挺好的。"

    "？""那就好。"

    "宮看向青年旁边的少女。"

    show sister d at right with dissolve

    s "你好呀！我叫藤原千鹤！是「奥斯勒」空间站的管理员！也可以叫我站长。这位是中野圭，是空间站的技术总监。"

    "少女的目光不断的扫视着面前这位从医疗仓里钻出来的陌生面孔。"

    show guy d at left

    show sister i at right

    g "喂，别这样直勾勾的看着他，虽然很帅就是了。"

    g "抱歉，藤原她对帅哥总是有莫名其妙的好感。"

    show guy a at left

    g "对了，请问你叫什么名字？"

    m "藤原宮。"

    show guy h at left

    m "咦，怎么了？为什么你也直勾勾的看着我？"

    s "这位是…「奥斯勒」集团创始人的儿子？对不起，我是您失敬了。"

    m "啊哈哈二位不必这样，为了区分我和藤原小姐，姑且叫我宮吧，也不要称您了。话说为什么我会从医疗仓中醒来？"

    show guy a at left

    show sister b at right

    s "我记得令尊曾经说过，他构建了一副能容纳魔能的躯体送给您，也许是因为您在另一个世界，身体带不过来的缘故，或者是想让您更好的掌握魔能。"

    g "董事长和我们说过等他醒来要把一些事情告诉他吧。"

    s "是哦！好像是让咱介绍一下这里,还有什么『空间之杖』和『时间之玥』。"

    g "董事长和你说过有关「奥斯勒」的事情吗？"

    m "了解一点，比如你们在做虚拟现实。"

    g "果然只是表层啊。"

    scene bg ship
    with fade

    play music "Someday in the Rain.mp3"

label question:

    g "那么，你想要了解什么？"

menu:

    "「奥斯勒」空间站":
        jump question1

    "『空间之杖』和『时间之玥』":
        jump question2

    "没什么想问的了。":
        jump next1

label question1:

    g "这里是「奥斯勒」空间站，董事长斥巨资建造的项目。下面是「奥斯勒」空间站的基本介绍。"

    "「奥斯勒」空间站，又名克洛诺斯「Kronos」号核动力主力舰/战列舰，由「奥斯勒」集团设计并制造，全长314米，甲班长214米，最大可容纳300人。"

    "杀伤性装备配置：（A）主炮-等离子魔能炮，位于克洛诺斯甲班夹层，唯一一套装载在战列舰上的魔能武器。"

    "靠魔能驱动，因此需要无限魔晶/魔晶/魔能容器/提供魔能的生物提供魔能。经过短时间蓄力可以持续发射魔能束，对300km内的目标造成极大的伤害，并附加魔法效果。可以轻松击破聚能的抵抗领域。"

    "优点：射速极快，范围广，射程远，杀伤性极高，附加额外效果（如：冻结，灼烧，爆炸，吸引，干扰等），可以击破抵抗领域。"

    "缺点：在没有无限魔晶的情况下消耗极大，长时间使用会过热造成短暂性的无法攻击。"

    g "至于魔能的事情不必担心，即使无限魔晶损坏也有备用的魔能，况且提供动力和电力的是可控核聚变。"

    "（B）主炮-赫尔墨斯电磁轨道炮，位于克洛诺斯甲班夹层，经过较长时间蓄力可以发射威力极大的爆燃能量弹，对400km内的目标造成极大的伤害，大量消耗抵抗领域能量但无法击破聚能的抵抗领域。"

    "赫尔墨斯电磁轨道炮也可用来发射电磁脉冲弹使得抵抗领域暂时失效。"

    "优点：范围广，射程极远，杀伤性极高，可快速消耗抵抗领域的能量。"

    "缺点：射速慢，蓄力时间长，耗能大，成本较高，攻击分散的群体目标乏力。"

    "（C）副炮-等离子炮，位于克洛诺斯前甲板正中心。经过短时间蓄力可以发射温度高，速度快的粒子束，能融化绝大多数战舰级金属。"

    "优点：射速快，范围广，射程远，准度高，穿透性极强，耗能低，成本低。"

    "缺点：无法击穿聚能的抵抗领域，攻击群体目标乏力。"

    "（D）近防-12套激光近程防御武器系统，左右侧各6套。能对靠近克洛诺斯号的敌人造成毁灭性打击。"

    "优点：射速极快，成本较低。缺点：射程较近。"

    g "其实还有一个武器，名字叫毁灭-奥斯勒之心，位于舰桥顶端。听说极其危险的装置，是被意外的装上克洛诺斯。"

    "启动后需使用大量生物魔能驱动，理论上发射产生的魔能束会引起量子坍缩以及空间，时间的反向扭曲。其作用效果能摧毁行星。"

    g "至于优点和缺点，没人知道，也没人敢用这个武器。目前来看没有任何个体所提供的生物魔能可以启动它，更何况来上一发。"

    g "这玩意其实可以在夏天的时候遮阳用，每年夏天大家都会在甲板搭建泳池，没有它，游泳累了就只能回舱内休息。"

    m "你们是懂得夏天的。"

    g "咱继续。"

    "其他装备配置：（E）6个四维曲速引擎-克洛诺斯的主引擎，可以扭曲空间使克洛诺斯以超光速移动。一般情况下只有4个四维曲速引擎工作，剩下2个备用。"

    "（F）6个支配者反重力引擎-克洛诺斯的副引擎，维持克洛诺斯的正常三维运动，运行时噪声小，不易暴露。可以悬停，垂直起降。一般情况下只有4个支配者反重力引擎工作，剩下2个备用。"

    "（G）现象装置-克洛诺斯装备了5台大型的现象装置，在提供抵抗领域和不可视结界的同时，也可以侦测克洛诺斯周围的物体，并进行回避。"

    "改良后的现象装置减少了聚能抵抗领域的能量消耗，并新增了抗引力撕裂的效果，为世界与世界间折越时提供更稳定的保护。"

    "（H）智能AI 真理•克洛诺斯-第四代舰载智能AI。拥有仅次于指挥官，站长和副站长的操作权限。"

    g "这个AI可有来头，听说是董事长亲自调教出来的。"

    "性别：女 年龄：目测16岁左右 外貌：萝莉体型猫耳娘，白发 身高：142cm 性格：热情，开朗，体贴。主要作用：辅助操控克洛诺斯号的战斗，和管闲事。"

    m "老爹……"

    jump question

label question2:

    s "其实我对它们并不太了解，这是令尊留下的资料。"

    "第一章"

    "在遥远的大陆上，有一位年轻的冒险家名叫艾莉娜。她背负着沉重的命运，追寻着失散已久的哥哥的踪迹。艾莉娜心中充满了对母亲的思念，母亲曾经是一位伟大的战士，她生前曾留给女儿一把枪。多年来她一直精心保护这把枪，使其一尘不染，因为这是她的精神寄托。"

    "艾莉娜长大了，也到了征战沙场的年龄，她打开了尘封许久的盒子，拿出那把已经过时的老式燧发枪。即使战友嘲笑她的枪像是上个世纪的产物，艾莉娜依旧坚持要带着它上战场。"

    "看着战友们使用先进的自动步枪，而自己的燧发枪还会时不时的卡壳，但艾莉娜却一点都不羡慕，因为在使用这把枪时，冥冥之中能感受到母亲的气息。"

    "在一次战斗中，艾莉娜在丛林中迷路了，她深知掉队的风险，可此时，六个敌方的士兵正摸索着向艾莉娜所在的草丛前进，艾莉娜只能一动不动的趴在草丛里，甚至不敢呼吸。"

    "因为太过紧张，艾莉娜的小腿突然抽筋，疼的她蜷缩着身体，牙齿咬住嘴唇，不让自己发出一点声音。但在寂静的森林里，即使是微小的声音也会被捕捉，敌人停下脚步，向草丛中扫射。"

    "一瞬间，艾莉娜手中的燧发枪发出耀眼的白色光芒，即将射入艾莉娜身体的子弹也被白光包裹，竟然奇迹般的停下，悬浮在半空中。"

    "艾莉娜快速起身，想要击杀敌人，射出去的子弹在敌人周围爆炸，被白光包裹的敌人也全部被固定，无法动弹。艾莉娜看着手中发光的燧发枪，竟一时间不知道如何是好。再一抬头，六个敌人已全部窒息而亡。"

    "艾莉娜知道，这种力量绝对不可以被别人知道，于是她独自在丛林中走了两天两夜，逃离这里，一心去寻找失散的哥哥。"

    "途中，艾莉娜还发现这把枪有着神奇的效果。当她被子弹击中时，枪身会发出耀眼的白色光芒，艾莉娜眼前浮现出自己在不同时刻的片段，触摸健康时的片段，枪伤便消失了。"

    "随着时间的推移，艾莉娜渐渐掌握了这把枪的力量。她甚至能够通过控制时间短暂的回到过去或者前往未来，寻找关键的线索。"

    "艾莉娜继续踏上了寻找哥哥的旅程，这把枪的力量成为她坚定的后盾。她能够感受到这把枪中蕴藏着无尽的母爱，这份爱在她的心中燃烧，让她坚持不懈，直到她找到亲人的归宿。"

    "第二章"

    "亚历克斯出生在遥远的乡下，他外貌平平，也没什么特别之处，但他的父亲深知他的价值和潜力，从亚历克斯年幼时就开始让他苦练剑术，为的就是这一天。"

    "亚历克斯的18岁生日到来了，他满怀期待地打开了父亲为他准备的精美的礼物盒。眼前的景象让他陷入了好奇之中。那是一把普通的短剑，外观朴实无华，似乎并不起眼。它的刀身散发着微弱的银光，仿佛是一泓朦胧的月光洒在夜空之上。"

    "亚历克斯拿出短剑，感受到一股微妙的能量在手中流转。他的心灵仿佛与这把短剑产生了奇妙的共鸣。"

    "从小苦练剑术的亚历克斯并不陌生于剑的感觉，然而，当他试图挥舞这把短剑时，却发现它的重量异常轻盈，这让他感到一种前所未有的自由和灵活。"

    "亚历克斯迫不及待地跃入战场，凝视着敌人的眼神中透露出自信和决绝。他挥舞短剑，利刃划破空间，劈开一道裂痕，将敌人射出的子弹原封不动的还给他们。"

    "利用它的力量，亚历克斯穿梭于战场之间，令敌人手足无措。他神出鬼没，犹如夜幕中的幽影，灵活地利用空间裂隙，闪现至敌人身后，斩杀一切阻挡在他面前的敌人。"

    "亚历克斯发现，当他凝神聆听时，能够创造出以太空间，将敌人拖入其中。在以太中，他不会受到任何的伤害，并且能够操控以太中的一切。将大树连根拔起，使建筑物砸向敌人，或者让大地碎裂，都只在一念之间。"

    "随着时间的推移，亚历克斯的实力越发强大。他变得更加灵动和犀利，无人能及。然而，对于这把短剑的来历以及他父亲为何选择将其作为生日礼物的原因，亚历克斯心中仍有一层迷雾。"

    "他时常思考着这个问题，与短剑相伴的日子里，他也在寻找着答案。与此同时，他不断磨砺自己的剑术，希望有一天能够掌握这把短剑的全部力量，解开其中的谜团，继承父亲留下的遗志。"

    s "这些资料更像两则故事呢，真希望有一天能亲眼见到『空间之杖』和『时间之玥』。"

    jump question

label next1:

    play music "Sunlight.ogg"

    scene bg heal
    with fade

    show guy a at left

    show sister e at right

    g "嗯，虽然有医疗仓的维持，你使用这具身体的时间已经不短了，一会儿咱们一起去吃早餐吧！"

    s "好耶好耶！"

    m "那就打扰了。"

    stop music fadeout 1.0
    scene black with dissolve

    "第四幕"

    play music "Sunlight.ogg"

    scene bg bridge
    with fade

    "触摸未来，那是比改变历史更可怕的行为。"

    "未来，人类的确研发出培养「全能干细胞」的技术，使许多人摆脱由机械代替的身体，换上契合自身的生物器官，人类距离永生又近了一步..."

    show sister b at center with dissolve

    s "也许获得「全能干细胞」就能重构祂的躯体…"

    m "也许吧…"

    s "『空间之杖』能做到吗？"

    m "能。"

    show sister g at center

    s "我知道了…希望空间站那边能抓紧研究导出记忆的方法，即使脑子能重塑，但记忆可不一定能完全恢复，最好要在脑死亡之前导出。"

    m "装置能维持多久？"

    show sister h at center

    s "一个月没什么问题，总之，去催催空间站的那群傻瓜吧。"

    scene black with dissolve

    "两个月后"

    scene bg bridge
    with fade

    show sister e at center with dissolve

    s "OK！祂的记忆已经装在这里了，真是的，空间站那群傻瓜这么磨叽，害我还得修复碎片记忆。"

    m "这算好消息吗？"

    s "那是当然了！现在就差你去未来偷...啊不是，是借技术！这样你就能获得一个完整的「祂」啦！科技改变世界不是说着玩的！"

    m "你不担心吗？"

    show sister d at center

    s "嗐我担心个啥？你又不是没进去过「时间湍流」，再说了，你不还是完完整整的出来了嘛，一身轻松的。"

    m "……"

    s "你要是借不成，大不了就把他们都杀了呗，总之达成目的就行，快去快回哈！"

    m "……"

    show sister e at center

    s "啊好好好，我收回刚才说的话，你别瞪我了怪吓人的，这事也就你能做到啊！当我欠你个人情。"

    m "完事之后把祂借我玩几天。"

    show sister h at center

    s "没问题！前提是「祂」同意。"

    "……"

    scene black with dissolve

    "log"

    scene bg ai
    with fade

    play music "illurock.opus"

    "？""『# 检测到「全能干细胞」』3/3 100%% COMPLETE"

    "？""『# 检测到记忆载体』3/3 100%% COMPLETE"

    "？""『# 开始培养「全能干细胞」，成功读取执行模板』28/28 100%% COMPLETE"

    "？""『# 正在构建基本单位...执行复制...』342/342 100%% COMPLETE"

    "？""『# 正在执行分化...导入完整基因...』1/1 100%% COMPLETE"

    "？""『# 构造完成』9470/9482 99.87%% RESPOND"

    "？""『# 正在做最后的检查』1/1  100%% COMPLETE"

    "？""『# 修复』12/12 100%% COMPLETE"

    "？""『# 读取记忆载体...开始导入记忆』1/1  100%% COMPLETE"

    "？""『# 导入完成...检查记忆完整性』*/*  100%% COMPLETE"

    "？""『# 正在做最后的检查』1/1  100%% COMPLETE"

    "？""『# 导入完成』"

    scene black with dissolve

    "舰桥"

    scene bg bridge
    with fade

    play music "Sunlight.ogg"

    show sister a at center with dissolve

    s "呀呼！终于完成了！"

    m "不容易啊。"

    show sister g at center

    s "要是能在祂身上使用『时间之玥』，咱就不用费那么大的力气了。嗐，这家伙刚出生就欠下了债，真是够惨的。"

    m "那还能怎么办？这十点理智上限你给我补？"

    show sister f at center

    s "可拉倒吧！那种伤势你还死不了，坚持下就能回来，你却非要读档…"

    m "疼。"

    show sister g at center

    s "……"

    scene black with dissolve

    "医疗室"

    scene bg heal
    with fade

    "？""Hi！早上好呀！哇～你真的好可爱哦<捏脸><捏脸>你叫什么名字啊？我叫真理•克洛诺斯，是由奥斯勒空间站制造的第四代舰载智能AI。"

    "？""我…我叫艾拉，你好。"

    scene black with dissolve

    "舰桥"

    scene bg bridge
    with fade

    show sister a at center with dissolve

    s "所以，要抓紧让空间站研发关于乐土数据导出的方法了。"

    m "嗯，我会催的。"

    show sister f at center

    s "嗐，一点压力也不给他们是不行的！我想想...如果他们没有完成任务，本小姐就亲自出马让他们体验一下什么叫「死亡翻滚」！"

    m "那群文弱书生可受不了这！"

    show sister g at center

    s "求求你啦～"

    m "好吧好吧，别把他们玩坏了。"

    scene black with dissolve

    "……"

    "好久不见，爱莉希雅。"

    "End "

    return

